## Plan Result (demo_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 7 to change, 6 to destroy.</code></pre>

* Create
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;civil-citizen-ui&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;cmc&#34;]
* Update
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;civil-citizen-ui&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;cmc&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;civil-citizen-ui&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;cmc&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;civil-citizen-ui&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;cmc&#34;]
  * module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;civil-citizen-ui&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;cmc&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;civil-citizen-ui&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;cmc&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;civil-citizen-ui&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;cmc&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain["civil-citizen-ui"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      ~ expiration_date          = "0001-01-01T00:00:00.0000000" -> (known after apply)
      ~ host_name                = "civil-citizen-ui.demo.platform.hmcts.net" -> "moneyclaims.demo.platform.hmcts.net" # forces replacement
      ~ id                       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/civil-citizen-ui" -> (known after apply)
        name                     = "civil-citizen-ui"
      + validation_token         = (known after apply)
        # (1 unchanged attribute hidden)

      - timeouts {}

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/secrets/5bfb8978-e416-45d7-bc16-c4ce7016f966-civil-citizen-ui-demo-platform-hmcts-net" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain["cmc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      ~ expiration_date          = "0001-01-01T00:00:00.0000000" -> (known after apply)
      ~ host_name                = "moneyclaims.demo.platform.hmcts.net" -> "moneyclaims1.demo.platform.hmcts.net" # forces replacement
      ~ id                       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/cmc" -> (known after apply)
        name                     = "cmc"
      + validation_token         = (known after apply)
        # (1 unchanged attribute hidden)

      - timeouts {}

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/secrets/5bfb8978-e416-45d7-bc16-c4ce7016f966-moneyclaims-demo-platform-hmcts-net" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["civil-citizen-ui"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/civil-citizen-ui" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/associations/civil-citizen-ui" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["cmc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/cmc" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/associations/cmc" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["civil-citizen-ui"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/civil-citizen-ui" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/associations/civil-citizen-ui" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["cmc"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      ~ cdn_frontdoor_custom_domain_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/cmc" # forces replacement -> (known after apply) # forces replacement
      ~ id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/associations/cmc" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin["civil-citizen-ui"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
        id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/originGroups/civil-citizen-ui/origins/civil-citizen-ui"
        name                           = "civil-citizen-ui"
      ~ origin_host_header             = "civil-citizen-ui.demo.platform.hmcts.net" -> "moneyclaims.demo.platform.hmcts.net"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin["cmc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
        id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/originGroups/cmc/origins/cmc"
        name                           = "cmc"
      ~ origin_host_header             = "moneyclaims.demo.platform.hmcts.net" -> "moneyclaims1.demo.platform.hmcts.net"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A["civil-citizen-ui"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/civil-citizen-ui",
        ] -> (known after apply)
        id                              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/afdEndpoints/hmcts-demo/routes/civil-citizen-ui"
        name                            = "civil-citizen-ui"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A["cmc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/cmc",
        ] -> (known after apply)
        id                              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/afdEndpoints/hmcts-demo/routes/cmc"
        name                            = "cmc"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B["civil-citizen-ui"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/civil-citizen-ui",
        ] -> (known after apply)
        id                              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/afdEndpoints/hmcts-demo/routes/civil-citizen-uiHttpsRedirect"
        name                            = "civil-citizen-uiHttpsRedirect"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B["cmc"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      ~ cdn_frontdoor_custom_domain_ids = [
          - "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/customDomains/cmc",
        ] -> (known after apply)
        id                              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo/afdEndpoints/hmcts-demo/routes/cmcHttpsRedirect"
        name                            = "cmcHttpsRedirect"
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["civil-citizen-ui"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo"
      + id                       = (known after apply)
      + name                     = "civilcitizenuidemoPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/civilcitizenuidemoPremium"

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["cmc"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo"
      + id                       = (known after apply)
      + name                     = "cmcdemoPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/cmcdemoPremium"

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/hmcts-demo|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 8 to add, 7 to change, 6 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1846,"Program":"tfcmt","SHA1":"","Target":"demo_global","Vars":{}} -->